#pragma once

// Satisfactory SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "FG_FactoryGame_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class FactoryGame.FGActorRepresentation
// 0x0078 (0x00A0 - 0x0028)
class UFGActorRepresentation : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class AActor*                                      mRealActor;                                               // 0x0030(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FVector_NetQuantize                         mActorLocation;                                           // 0x0038(0x000C) (Net)
	struct FRotator                                    mActorRotation;                                           // 0x0044(0x000C) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               mIsStatic;                                                // 0x0050(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
	class UTexture2D*                                  mRepresentationTexture;                                   // 0x0058(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FText                                       mRepresentationText;                                      // 0x0060(0x0028) (Net)
	struct FLinearColor                                mRepresentationColor;                                     // 0x0078(0x0010) (Net, ZeroConstructor, IsPlainOldData)
	ERepresentationType                                mRepresentationType;                                      // 0x0088(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	EFogOfWarRevealType                                mFogOfWarRevealType;                                      // 0x0089(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x008A(0x0002) MISSED OFFSET
	float                                              mFogOfWarRevealRadius;                                    // 0x008C(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0090(0x0008) MISSED OFFSET
	bool                                               mShouldShowInCompass;                                     // 0x0098(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               mShouldShowOnMap;                                         // 0x0099(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x6];                                       // 0x009A(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGActorRepresentation");
		return ptr;
	}


	void OnRep_ShouldShowOnMap();
	void OnRep_ShouldShowInCompass();
	void OnRep_RepresentationTexture();
	void OnRep_RepresentationText();
	void OnRep_RepresentationColor();
	void OnRep_FogOfWarRevealType();
	void OnRep_FogOfWarRevealRadius();
	bool IsActorStatic();
	bool GetShouldShowOnMap();
	bool GetShouldShowInCompass();
	ERepresentationType GetRepresentationType();
	class UTexture2D* GetRepresentationTexture();
	struct FText GetRepresentationText();
	struct FLinearColor GetRepresentationColor();
	class AActor* GetRealActor();
	bool GetIsTemporary();
	EFogOfWarRevealType GetFogOfWarRevealType();
	float GetFogOfWarRevealRadius();
	struct FRotator GetActorRotation();
	struct FVector GetActorLocation();
};


// Class FactoryGame.FGActorRepresentationInterface
// 0x0000 (0x0028 - 0x0028)
class UFGActorRepresentationInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGActorRepresentationInterface");
		return ptr;
	}


	bool UpdateRepresentation();
	struct FText SetActorRepresentationText(const struct FText& newText);
	bool RemoveAsRepresentation();
	bool IsActorStatic();
	struct FRotator GetRealActorRotation();
	struct FVector GetRealActorLocation();
	bool GetActorShouldShowOnMap();
	bool GetActorShouldShowInCompass();
	ERepresentationType GetActorRepresentationType();
	class UTexture2D* GetActorRepresentationTexture();
	struct FText GetActorRepresentationText();
	struct FLinearColor GetActorRepresentationColor();
	EFogOfWarRevealType GetActorFogOfWarRevealType();
	float GetActorFogOfWarRevealRadius();
	bool AddAsRepresentation();
};


// Class FactoryGame.FGSubsystem
// 0x0000 (0x0328 - 0x0328)
class AFGSubsystem : public AInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGSubsystem");
		return ptr;
	}

};


// Class FactoryGame.FGActorRepresentationManager
// 0x0080 (0x03A8 - 0x0328)
class AFGActorRepresentationManager : public AFGSubsystem
{
public:
	struct FScriptMulticastDelegate                    mOnActorRepresentationAdded;                              // 0x0328(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationRemoved;                            // 0x0338(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationUpdated;                            // 0x0348(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationUpdatedCompassShow;                 // 0x0358(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationUpdatedMapShow;                     // 0x0368(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class UFGActorRepresentation*>              mReplicatedRepresentations;                               // 0x0378(0x0010) (Net, ZeroConstructor)
	TArray<class UFGActorRepresentation*>              mClientReplicatedRepresentations;                         // 0x0388(0x0010) (ZeroConstructor)
	TArray<class UFGActorRepresentation*>              mLocalRepresentations;                                    // 0x0398(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGActorRepresentationManager");
		return ptr;
	}


	bool UpdateRepresentation(class AActor* realActor, bool isLocal);
	bool RemoveRepresentationOfActor(class AActor* realActor);
	void OnRep_ReplicatedRepresentations();
	void GetAllActorRepresentations(TArray<class UFGActorRepresentation*>* out_AllRepresentations);
	class AFGActorRepresentationManager* Get(class UObject* WorldContext);
	bool CreateAndAddNewRepresentationNoActor(const struct FVector& Location, class UTexture2D* compassTexture, const struct FLinearColor& compassColor, float LifeTime, bool shouldShowInCompass, bool shouldShowOnMap, ERepresentationType representationType, bool isLocal);
	bool CreateAndAddNewRepresentation(class AActor* realActor, bool isLocal);
};


// Class FactoryGame.FGAggroTargetInterface
// 0x0000 (0x0028 - 0x0028)
class UFGAggroTargetInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAggroTargetInterface");
		return ptr;
	}


	void UnregisterAttacker(class AFGEnemyController* forController);
	bool ShouldAutoregisterAsTargetable();
	void RegisterIncomingAttacker(class AFGEnemyController* forController);
	bool IsAlive();
	class UPrimitiveComponent* GetTargetComponent();
	float GetEnemyTargetDesirability(class AFGEnemyController* forController);
	struct FVector GetAttackLocation();
	class AActor* GetActor();
};


// Class FactoryGame.FGAISystem
// 0x00A0 (0x01D0 - 0x0130)
class UFGAISystem : public UAISystem
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0130(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    mOnAggroTargetAdded;                                      // 0x0138(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnAggroTargetRemoved;                                    // 0x0148(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              mDisableAIDistance;                                       // 0x0158(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mNavWalkingDistance;                                      // 0x015C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mMeshTickEnableDistance;                                  // 0x0160(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mMeshUpdateDistance;                                      // 0x0164(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mActivateSpawnerDistance;                                 // 0x0168(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mDisablePawnMovement;                                     // 0x016C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5B];                                      // 0x016D(0x005B) MISSED OFFSET
	int                                                mMaxCreatureIterationsPerTick;                            // 0x01C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                mMaxSpawnerIterationsPerTick;                             // 0x01CC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAISystem");
		return ptr;
	}


	void UnpardonActor(class AActor* inActor);
	void RemoveFromTargetableList(const TScriptInterface<class UFGAggroTargetInterface>& aggroTarget);
	void PlayerDestroyed(class AActor* destroyedPlayer);
	void PardonActor(class AActor* inActor);
	bool IsActorPardoned(class AActor* inActor);
	TArray<TScriptInterface<class UFGAggroTargetInterface>> GetAggroTargetList();
	void CreatureDestroyed(class AActor* destroyedEnemy);
	void ClearAllPardonedActors();
	void AggroTargetDestroyed(class AActor* DestroyedActor);
	void AddToTargetableList(const TScriptInterface<class UFGAggroTargetInterface>& aggroTarget);
};


// Class FactoryGame.FGAmbientSettings
// 0x0028 (0x0050 - 0x0028)
class UFGAmbientSettings : public UObject
{
public:
	class UAkAudioEvent*                               mOnEnterOuterVolumeEvent;                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               mOnExitOuterVolumeEvent;                                  // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               mOnEnterInnerVolumeEvent;                                 // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               mOnExitInnerVolumeEvent;                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      mIgnoreListenerRotation : 1;                              // 0x0048(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAmbientSettings");
		return ptr;
	}


	bool ShouldIgnoreListenerRotation();
	void OnExitOuterVolume(class UAkComponent* ambientComponent);
	void OnExitInnerVolume(class UAkComponent* ambientComponent);
	void OnEnterOuterVolume(class UAkComponent* ambientComponent);
	void OnEnterInnerVolume(class UAkComponent* ambientComponent);
	class UAkAudioEvent* GetEnterOuterVolumeEvent();
	class UAkAudioEvent* GetEnterInnerVolumeEvent();
};


// Class FactoryGame.FGAmbientSoundSpline
// 0x0020 (0x0348 - 0x0328)
class AFGAmbientSoundSpline : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0328(0x0008) MISSED OFFSET
	class USplineComponent*                            mSpline;                                                  // 0x0330(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFGSoundSplineComponent*                     mSoundSpline;                                             // 0x0338(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              mSignificanceRange;                                       // 0x0340(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0344(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAmbientSoundSpline");
		return ptr;
	}


	class USplineComponent* GetSplineComponent();
};


// Class FactoryGame.FGAmbientVolume
// 0x0040 (0x03A0 - 0x0360)
class AFGAmbientVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0360(0x0008) MISSED OFFSET
	class UClass*                                      mAmbientSettings;                                         // 0x0368(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UAkComponent*                                mAudioComponent;                                          // 0x0370(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	float                                              mAdditionalAttenuationDistance;                           // 0x0378(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x20];                                      // 0x037C(0x0020) MISSED OFFSET
	float                                              mSignificanceRange;                                       // 0x039C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAmbientVolume");
		return ptr;
	}

};


// Class FactoryGame.FGAnimNotify_Attack
// 0x0000 (0x0038 - 0x0038)
class UFGAnimNotify_Attack : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimNotify_Attack");
		return ptr;
	}

};


// Class FactoryGame.FGAnimNotify_FootDown
// 0x0008 (0x0040 - 0x0038)
class UFGAnimNotify_FootDown : public UAnimNotify
{
public:
	int                                                mFootIndex;                                               // 0x0038(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mPlaySound;                                               // 0x003C(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimNotify_FootDown");
		return ptr;
	}

};


// Class FactoryGame.FGAnimNotify_Landed
// 0x0000 (0x0038 - 0x0038)
class UFGAnimNotify_Landed : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimNotify_Landed");
		return ptr;
	}

};


// Class FactoryGame.FGCharacterAnimInstance
// 0x0120 (0x0480 - 0x0360)
class UFGCharacterAnimInstance : public UAnimInstance
{
public:
	struct FVector                                     mVelocity;                                                // 0x0360(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     mVelocityLocalNormalized;                                 // 0x036C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     mAccelerationLocalNormalized;                             // 0x0378(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0384(0x000C) MISSED OFFSET
	struct FTransform                                  mActorTransform;                                          // 0x0390(0x0030) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	class AFGCharacterBase*                            mCachedCharacter;                                         // 0x03C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         mCachedMovementMode;                                      // 0x03C8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         mCachedDefaultWalkMode;                                   // 0x03C9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x03CA(0x0002) MISSED OFFSET
	float                                              mSpeed;                                                   // 0x03CC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mSpeedLastFrame;                                          // 0x03D0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mSpeedZ;                                                  // 0x03D4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mWalkRotation;                                            // 0x03D8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mIsStandingStill;                                         // 0x03DC(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mIsAccelerating;                                          // 0x03DD(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x03DE(0x0002) MISSED OFFSET
	float                                              mYawDelta;                                                // 0x03E0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYaw;                                                  // 0x03E4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYawInterpSpeed;                                       // 0x03E8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    mRootRotation;                                            // 0x03EC(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mTurnInPlaceLeft;                                         // 0x03F8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mTurnInPlaceRight;                                        // 0x03F9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mTurnInPlaceComplete;                                     // 0x03FA(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x5];                                       // 0x03FB(0x0005) MISSED OFFSET
	class UCurveFloat*                                 mTurnLeftCurve;                                           // 0x0400(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveFloat*                                 mTurnRightCurve;                                          // 0x0408(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     mActorRotationForwardVector;                              // 0x0410(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     mActorRotationForwardVectorReference;                     // 0x041C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYawReductionStartTime;                                // 0x0428(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYawReductionCurrentTime;                              // 0x042C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    mActorRotationLastTick;                                   // 0x0430(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mYawRotationStrength;                                     // 0x043C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mYawRotationInterpSpeed;                                  // 0x0440(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mRootRotationInterpSpeed;                                 // 0x0444(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mAllowedToTurn;                                           // 0x0448(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0449(0x0007) MISSED OFFSET
	float                                              mTurnInPlaceDefaultTime;                                  // 0x0450(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mUseTurnInPlace;                                          // 0x0454(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mCanUpdateActorRotationReference;                         // 0x0455(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x0456(0x0002) MISSED OFFSET
	float                                              mYawAimMaxValue;                                          // 0x0458(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mYawAimMinValue;                                          // 0x045C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mAimPitch;                                                // 0x0460(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimPitchInterpSpeed;                                     // 0x0464(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mGetDeltaPitchRotation;                                   // 0x0468(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mUsePreLand;                                              // 0x0469(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mPreLand;                                                 // 0x046A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x046B(0x0001) MISSED OFFSET
	float                                              mPreLandVelocityMultiplier;                               // 0x046C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<TEnumAsByte<ECollisionChannel>>             mPreLandCollisionChannels;                                // 0x0470(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGCharacterAnimInstance");
		return ptr;
	}


	void OnRadialDamageTaken();
	void OnPointDamageTaken(const struct FVector& shootDIrection);
	void OnAnyDamageTaken();
	float GetVelocityDirection();
	struct FVector GetVelocity();
	struct FRotator GetDesiredWalkRotation();
	struct FRotator GetDesiredRunLeanRotation();
	class AFGCharacterBase* GetCachedCharacter();
	float GetAccelerationVectorLength();
};


// Class FactoryGame.FGAnimPlayer
// 0x0010 (0x0490 - 0x0480)
class UFGAnimPlayer : public UFGCharacterAnimInstance
{
public:
	bool                                               mIsFirstPerson;                                           // 0x0480(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EArmEquipment                                      mArmSlotType;                                             // 0x0481(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBackEquipment                                     mBacklotType;                                             // 0x0482(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0483(0x0005) MISSED OFFSET
	class AFGCharacterPlayer*                          mCharacter;                                               // 0x0488(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimPlayer");
		return ptr;
	}

};


// Class FactoryGame.FGAssetManager
// 0x0000 (0x03D8 - 0x03D8)
class UFGAssetManager : public UAssetManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAssetManager");
		return ptr;
	}

};


// Class FactoryGame.FGHologram
// 0x0088 (0x03B0 - 0x0328)
class AFGHologram : public AActor
{
public:
	TArray<class UClass*>                              mValidHitClasses;                                         // 0x0328(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst)
	class UClass*                                      mRecipe;                                                  // 0x0338(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	class UAkComponent*                                mLoopSound;                                               // 0x0340(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBoxComponent*                               mClearanceDetector;                                       // 0x0348(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0350(0x000C) MISSED OFFSET
	bool                                               mPlacementMaterial;                                       // 0x035C(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x035D(0x0003) MISSED OFFSET
	class UMaterialInstance*                           mValidPlacementMaterial;                                  // 0x0360(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           mInvalidPlacementMaterial;                                // 0x0368(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class AFGHologram*>                         mChildren;                                                // 0x0370(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0380(0x0008) MISSED OFFSET
	class APawn*                                       mConstructionInstigator;                                  // 0x0388(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               mIsDisabled;                                              // 0x0390(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               mIsChanged;                                               // 0x0391(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x16];                                      // 0x0392(0x0016) MISSED OFFSET
	int                                                mInitialScrollModeValue;                                  // 0x03A8(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x03AC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGHologram");
		return ptr;
	}


	void Server_SetSnapToGuideLines(bool IsEnabled);
	void OnRep_PlacementMaterial();
	void OnRep_InitialScrollModeValue();
	bool IsChanged();
	bool GetNoSnapMode();
	void GetConstructDisqualifiers(TArray<class UClass*>* out_constructResults);
	void Client_PlaySnapSound();
	bool CanConstruct();
	void AddValidHitClass(class UClass* hitClass);
};


// Class FactoryGame.FGBuildableHologram
// 0x0030 (0x03E0 - 0x03B0)
class AFGBuildableHologram : public AFGHologram
{
public:
	class UClass*                                      mBuildableClass;                                          // 0x03B0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	float                                              mMaxPlacementFloorAngle;                                  // 0x03B8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03BC(0x0004) MISSED OFFSET
	class UFGFactoryLegsComponent*                     mLegs;                                                    // 0x03C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x03C8(0x0008) MISSED OFFSET
	class UBoxComponent*                               mClearanceBox;                                            // 0x03D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x03D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGBuildableHologram");
		return ptr;
	}


	void ReceiveConfigureComponents(class AFGBuildable* inBuildable);
	void ReceiveConfigureActor(class AFGBuildable* inBuildable);
};


// Class FactoryGame.FGFactoryHologram
// 0x0068 (0x0448 - 0x03E0)
class AFGFactoryHologram : public AFGBuildableHologram
{
public:
	class UStaticMeshComponent*                        mClearanceMeshComponent;                                  // 0x03E0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UStaticMesh*                                 mClearanceMesh;                                           // 0x03E8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          mClearanceMaterial;                                       // 0x03F0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x50];                                      // 0x03F8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGFactoryHologram");
		return ptr;
	}

};


// Class FactoryGame.FGConveyorAttachmentHologram
// 0x0018 (0x0460 - 0x0448)
class AFGConveyorAttachmentHologram : public AFGFactoryHologram
{
public:
	float                                              mMaxValidTurnOffset;                                      // 0x0448(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mMaxValidTurnAngle;                                       // 0x044C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class AFGBuildableConveyorBelt*                    mSnappedConveyor;                                         // 0x0450(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0458(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGConveyorAttachmentHologram");
		return ptr;
	}

};


// Class FactoryGame.FGAttachmentSplitterHologram
// 0x0018 (0x0478 - 0x0460)
class AFGAttachmentSplitterHologram : public AFGConveyorAttachmentHologram
{
public:
	class AFGBuildableAttachmentSplitter*              mUpgradedSplitter;                                        // 0x0460(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class UFGFactoryConnectionComponent*>       mSnappedConnectionComponents;                             // 0x0468(0x0010) (ExportObject, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAttachmentSplitterHologram");
		return ptr;
	}

};


// Class FactoryGame.FGAttack
// 0x0028 (0x0050 - 0x0028)
class UFGAttack : public UObject
{
public:
	class UAnimMontage*                                mAttackMontage;                                           // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mStopsMovement;                                           // 0x0030(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	float                                              mAttackRange;                                             // 0x0034(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mAttackActivationDistance;                                // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                mDamage;                                                  // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      mDamageType;                                              // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mAttackAngle;                                             // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAttack");
		return ptr;
	}


	bool GetStopsMovement(class UClass* inClass);
	class UClass* GetDamageType(class UClass* inClass);
	int GetDamage(class UClass* inClass);
	float GetAttackRange(class UClass* inClass);
	class UAnimMontage* GetAttackMontage(class UClass* inClass);
	float GetAttackAngle(class UClass* inClass);
	float GetAttackActivationDistance(class UClass* inClass);
};


// Class FactoryGame.FGAttackCustomRadial
// 0x0000 (0x0050 - 0x0050)
class UFGAttackCustomRadial : public UFGAttack
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAttackCustomRadial");
		return ptr;
	}

};


// Class FactoryGame.FGAttackMelee
// 0x0000 (0x0050 - 0x0050)
class UFGAttackMelee : public UFGAttack
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAttackMelee");
		return ptr;
	}

};


// Class FactoryGame.FGAttackMeleeJump
// 0x0018 (0x0068 - 0x0050)
class UFGAttackMeleeJump : public UFGAttackMelee
{
public:
	float                                              mJumpRange;                                               // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     mJumpVelocity;                                            // 0x0054(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                mPreJumpMontage;                                          // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAttackMeleeJump");
		return ptr;
	}


	class UAnimMontage* GetPreJumpMontage(class UClass* inClass);
	struct FVector GetJumpVelocity(class UClass* inClass);
	float GetJumpRange(class UClass* inClass);
};


// Class FactoryGame.FGAttackRanged
// 0x0008 (0x0058 - 0x0050)
class UFGAttackRanged : public UFGAttack
{
public:
	class UClass*                                      mProjectileClass;                                         // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAttackRanged");
		return ptr;
	}


	void SpawnProjectile(class AActor* targetActor, class AFGEnemy* sourceActor);
};


// Class FactoryGame.FGAttentionPingActor
// 0x0008 (0x0330 - 0x0328)
class AFGAttentionPingActor : public AActor
{
public:
	int                                                mPlayerSlotIdx;                                           // 0x0328(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x032C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAttentionPingActor");
		return ptr;
	}


	void SpawnAttentionPingEffects();
	void OnRep_PlayerSlotIdx();
	int GetPlayerSlotIdx();
};


// Class FactoryGame.FGMessageBase
// 0x0058 (0x0260 - 0x0208)
class UFGMessageBase : public UUserWidget
{
public:
	struct FText                                       mTitle;                                                   // 0x0208(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FText                                       mPreviewText;                                             // 0x0220(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                               mIsPopup;                                                 // 0x0238(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0239(0x0007) MISSED OFFSET
	class UClass*                                      mSenderClass;                                             // 0x0240(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EMessageType                                       mType;                                                    // 0x0248(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0249(0x0007) MISSED OFFSET
	TArray<class UTexture2D*>                          mImages;                                                  // 0x0250(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGMessageBase");
		return ptr;
	}


	class UObject* GetMessageDefaultObject(class UClass* inClass);
};


// Class FactoryGame.FGAudioMessage
// 0x0068 (0x02C8 - 0x0260)
class UFGAudioMessage : public UFGMessageBase
{
public:
	class UAkComponent*                                mAkAudioComponent;                                        // 0x0260(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FAudioSubtitlePair>                  mAudioEvents;                                             // 0x0268(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0278(0x0008) MISSED OFFSET
	struct FAudioSubtitlePair                          mCurrentDialogue;                                         // 0x0280(0x0028)
	float                                              mSubtitleTimeMultiplier;                                  // 0x02A8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02AC(0x0004) MISSED OFFSET
	struct FScriptDelegate                             mAudioMessageConcluded;                                   // 0x02B0(0x0014) (ZeroConstructor, InstancedReference)
	class UInputComponent*                             mAudioMessageInputComponent;                              // 0x02C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAudioMessage");
		return ptr;
	}


	void StartPlayback();
	void PlayNextDialogue();
	struct FAudioSubtitlePair GetCurrentDialogue();
	void ContinuePlayback();
	void CancelPlayback();
	void AssignOnConcludedDelegate(const struct FScriptDelegate& concludedDelegate);
};


// Class FactoryGame.FGAudioVolumeSubsystem
// 0x0000 (0x0328 - 0x0328)
class AFGAudioVolumeSubsystem : public AFGSubsystem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAudioVolumeSubsystem");
		return ptr;
	}

};


// Class FactoryGame.FGBaseUI
// 0x0020 (0x0228 - 0x0208)
class UFGBaseUI : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0208(0x0008) MISSED OFFSET
	class UFGPopupWidget*                              mActivePopup;                                             // 0x0210(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0218(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGBaseUI");
		return ptr;
	}


	void SetPopup(class UFGPopupWidget* inPopup);
	void PopPopupQueue();
	class UFGPopupWidget* GetPopup();
	class UFGPopupWidget* CreatePopupWidget(const struct FPopupData& PopupData);
	void ClosePopup();
	void AddPopup(const struct FText& Title, const struct FText& Body, const struct FScriptDelegate& ConfirmClickDelegate, TEnumAsByte<EPopupId> PopupID, class UClass* PopupClass);
};


// Class FactoryGame.FGBeacon
// 0x0000 (0x0328 - 0x0328)
class AFGBeacon : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGBeacon");
		return ptr;
	}

};


// Class FactoryGame.FGBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFGBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGBlueprintFunctionLibrary");
		return ptr;
	}


	void UpdateUseState(class UClass* newState, struct FUseState* State);
	void TravelToMainMenu(class APlayerController* PlayerController);
	void ShowOutline(class UPrimitiveComponent* comp, EOutlineColor Color);
	void RemoveGenericTickObjectFromSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void RemoveGainSignificanceObjectFromSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void RemoveFactoryObjectFromSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void RemoveConveyorBeltFromSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void RemoveAudioVolumeFromSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void RemoveAmbientSoundSplineFromSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	float LogX(float Base, float Value);
	class FString LinearColorToHex(const struct FLinearColor& inColor);
	bool IsLocationNearABase(class UObject* WorldContext, const struct FVector& InLocation, float closeDistance);
	bool IsLocallyHumanControlled(class APawn* Pawn);
	bool IsInAlwaysLoadedLevel(class AActor* Actor);
	bool IsGameWorld(class UObject* WorldContext);
	bool IsEditorWorld(class UObject* WorldContext);
	bool IsAlphaBuild();
	bool ImpactEffectIsWithinDistance(class UObject* WorldContext, class APawn* Instigator, const struct FVector& SpawnLocation, float visibleCullDistance);
	bool ImpactEffectIsRelevant(class UObject* WorldContext, class APawn* Instigator, const struct FVector& SpawnLocation, float visibleCullDistance, float alwaysSuccessDistance, bool skipLOSCheck);
	void HideOutline(class UPrimitiveComponent* comp);
	class FString GetVersionString();
	class AActor* GetOuterActor(class UObject* Obj);
	class FString GetLanguage();
	struct FName GetComponentFlagSoftLanding();
	void GetAvailableSubCategoriesForCategory(class UObject* WorldContext, class UClass* buildCategory, TArray<class UClass*>* out_subCategories);
	void GetAvailableRecipesInSubCategory(class UObject* WorldContext, class UClass* subCategory, TArray<class UClass*>* out_recipes);
	void GetAvailableRecipesInCategory(class UObject* WorldContext, class UClass* buildCategory, TArray<class UClass*>* out_recipes);
	void GetAllWidgetsOfClassInHierarchy(class UWidget* hierarchyContext, class UClass* WidgetClass, TArray<class UWidget*>* FoundWidgets);
	void GetAllDescriptorsSorted(class UObject* WorldContext, TArray<class UClass*>* out_descriptors);
	void GetAllBuildCategories(class UObject* WorldContext, TArray<class UClass*>* out_buildCategories);
	void CreateSessionAndTravelToMap(class APlayerController* Player, const class FString& mapName, const class FString& options, const class FString& SessionName, TEnumAsByte<ESessionVisibility> sessionVisibility);
	float CmS2KmH(float CmS);
	void ClosePopup(class APlayerController* Controller);
	void Cheat_GetAllDescriptors(TArray<class UClass*>* out_descriptors);
	void ChangeLanguage(const class FString& Target);
	bool CanBeOnConveyor(class UClass* inClass);
	void AddPopupWithCloseDelegate(class APlayerController* Controller, const struct FText& Title, const struct FText& Body, const struct FScriptDelegate& CloseDelegate, TEnumAsByte<EPopupId> PopupID, class UClass* PopupClass, class UObject* popupInstigator);
	void AddPopup(class APlayerController* Controller, const struct FText& Title, const struct FText& Body, const struct FScriptDelegate& ConfirmClickDelegate, TEnumAsByte<EPopupId> PopupID, class UClass* PopupClass, class UObject* popupInstigator);
	void AddGenericTickObjectToSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void AddGainSignificanceObjectToSignificanceManager(class UObject* WorldContextObject, class UObject* Obj, float desiredGainDistance);
	void AddFactoryObjectToSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void AddConveyorBeltToSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void AddAudioVolumeToSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
	void AddAmbientSoundSplineToSignificanceManager(class UObject* WorldContextObject, class UObject* Obj);
};


// Class FactoryGame.FGBoundedTextRenderComponent
// 0x0000 (0x05B0 - 0x05B0)
class UFGBoundedTextRenderComponent : public UTextRenderComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGBoundedTextRenderComponent");
		return ptr;
	}


	void AssignBoundingBox(class UBoxComponent* BoxComponent);
};


// Class FactoryGame.FGBuildable
// 0x0240 (0x0568 - 0x0328)
class AFGBuildable : public AActor
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0328(0x0020) MISSED OFFSET
	class UClass*                                      mHologramClass;                                           // 0x0348(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FText                                       mDisplayName;                                             // 0x0350(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FText                                       mDescription;                                             // 0x0368(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FFactoryTickFunction                        mFactoryTickFunction;                                     // 0x0380(0x0058) (Edit, DisableEditOnInstance)
	struct FLinearColor                                mPrimaryColor;                                            // 0x03D8(0x0010) (ZeroConstructor, SaveGame, IsPlainOldData)
	struct FLinearColor                                mSecondaryColor;                                          // 0x03E8(0x0010) (ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      mColorSlot;                                               // 0x03F8(0x0001) (Net, ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x03F9(0x0007) MISSED OFFSET
	class UClass*                                      mBuildEffectTemplate;                                     // 0x0400(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      mDismantleEffectTemplate;                                 // 0x0408(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0410(0x0008) MISSED OFFSET
	class AActor*                                      mBuildEffectInstignator;                                  // 0x0418(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              mDismantleEffectClassName;                                // 0x0420(0x0018) (ZeroConstructor, Config, NoClear)
	struct FSoftClassPath                              mBuildEffectClassName;                                    // 0x0438(0x0018) (ZeroConstructor, Config, NoClear)
	float                                              mBuildEffectSpeed;                                        // 0x0450(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mForceNetUpdateOnRegisterPlayer;                          // 0x0454(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0455(0x0003) MISSED OFFSET
	struct FSoftClassPath                              mHighlightParticleClassName;                              // 0x0458(0x0018) (ZeroConstructor, Config, NoClear)
	class UParticleSystem*                             mHighlightParticleSystemTemplate;                         // 0x0470(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystemComponent*                    mHighlightParticleSystemComponent;                        // 0x0478(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	bool                                               mDidFirstTimeUse;                                         // 0x0480(0x0001) (Net, ZeroConstructor, SaveGame, IsPlainOldData)
	bool                                               mShouldShowHighlight;                                     // 0x0481(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1E];                                      // 0x0482(0x001E) MISSED OFFSET
	float                                              mCameraDistanceSq;                                        // 0x04A0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                mBuildingID;                                              // 0x04A4(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	TArray<struct FItemAmount>                         mDismantleRefund;                                         // 0x04A8(0x0010) (ZeroConstructor, SaveGame)
	unsigned char                                      UnknownData05[0x10];                                      // 0x04B8(0x0010) MISSED OFFSET
	bool                                               mIsUseable;                                               // 0x04C8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x04C9(0x0007) MISSED OFFSET
	class UClass*                                      mInteractWidgetClass;                                     // 0x04D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x8];                                       // 0x04D8(0x0008) MISSED OFFSET
	TArray<class AFGCharacterPlayer*>                  mInteractingPlayers;                                      // 0x04E0(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData08[0x8];                                       // 0x04F0(0x0008) MISSED OFFSET
	class UClass*                                      mBuiltWithRecipe;                                         // 0x04F8(0x0008) (Net, ZeroConstructor, SaveGame, IsPlainOldData)
	float                                              mBuildTimeStamp;                                          // 0x0500(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData09[0x4];                                       // 0x0504(0x0004) MISSED OFFSET
	class UShapeComponent*                             mCachedShapeComponent;                                    // 0x0508(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USceneComponent*                             mHighlightLocation;                                       // 0x0510(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData10[0x50];                                      // 0x0518(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGBuildable");
		return ptr;
	}


	void ShowHighlightEffect();
	void RemoveHighlightEffect();
	void ReapplyColorSlot();
	void PlayDismantleSound();
	void PlayDismantleEffects();
	void PlayConstructSound();
	void PlayBuildEffects(class AActor* inInstigator);
	void OnRep_SecondaryColor();
	void OnRep_PrimaryColor();
	void OnRep_DidFirstTimeUse();
	void OnRep_ColorSlot();
	unsigned char GetNumPowerConnections();
	TArray<class UMeshComponent*> GetMainMeshes();
	class UClass* GetInteractWidgetClass();
	void GetDismantleBlueprintReturns(TArray<struct FInventoryStack>* out_returns);
	class UShapeComponent* GetClearanceComponent();
	void Factory_ReceiveTick(float DeltaTime);
	bool Factory_PeekOutput(class UFGFactoryConnectionComponent* Connection, class UClass* Type, TArray<struct FInventoryItem>* out_items);
	bool Factory_GrabOutput(class UFGFactoryConnectionComponent* Connection, class UClass* Type, struct FInventoryItem* out_item, float* out_OffsetBeyond);
};


// Class FactoryGame.FGBuildableFactory
// 0x00E8 (0x0650 - 0x0568)
class AFGBuildableFactory : public AFGBuildable
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0568(0x0028) MISSED OFFSET
	float                                              mPowerConsumption;                                        // 0x0590(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mPowerConsumptionExponent;                                // 0x0594(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      mPowerInfoClass;                                          // 0x0598(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UFGPowerInfoComponent*                       mPowerInfo;                                               // 0x05A0(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData)
